In [1]:
import pandas as pd

df = pd.read_csv('data/tt_data.csv')
df['Experience'] = pd.to_numeric(df['Experience'].str[:-1])*1000
df['Date'] = pd.to_datetime(df['Date'])

df.to_csv('data/tt_data.csv')

/tmp/ipykernel_3913/2264502925.py:5: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['Date'] = pd.to_datetime(df['Date'])

In [10]:
df['exp_gain']= df.groupby('Name')['Experience'].max()-df.groupby('Name')['Experience'].min()

In [11]:
df

              Name       Date  Experience  exp_gain
0            Zusha 2025-11-30      640000       NaN
1    grtAttractor1 2025-11-30      143000       NaN
2          Moodies 2025-11-30     1540000       NaN
3       Sleepymilo 2025-11-30     2362000       NaN
4       VHSVoyager 2025-11-30     2292000       NaN
..             ...        ...         ...       ...
626           Drav 2026-01-25      557000       NaN
627           Yuzu 2026-01-25      276000       NaN
628       skeeskee 2026-01-25      388000       NaN
629       daisycat 2026-01-25      488000       NaN
630        Yatagan 2026-01-25      611000       NaN

[631 rows x 4 columns]

In [19]:
(df.groupby('Name')['Experience'].max()-df.groupby('Name')['Experience'].min())

Name
Aleksander     336000
Antagonist      55000
Arguvan        319000
ArmSor         369000
Atherises     9386000
               ...
miniTorque     299000
rowso          143000
skeeskee       111000
smitty8         48000
tamagucci      105000
Name: Experience, Length: 71, dtype: int64

In [24]:
(df.groupby('Name')['Experience'].max()-df.groupby('Name')['Experience'].min()).to_frame().reset_index()

          Name  Experience
0   Aleksander      336000
1   Antagonist       55000
2      Arguvan      319000
3       ArmSor      369000
4    Atherises     9386000
..         ...         ...
66  miniTorque      299000
67       rowso      143000
68    skeeskee      111000
69     smitty8       48000
70   tamagucci      105000

[71 rows x 2 columns]